{
  "movies": [
    {
      "id": 1,
      "title": "Avatar The Way of Water",
      "featured": true,
      "image": "MovieImages/Avatar_The_Way_of_Water_poster.jpg",
      "summary":"Set more than a decade after the first film, it follows Jake Sully, now living as a Na'vi on Pandora, and his family—Neytiri and their children—as they face new threats. When humans return to colonize Pandora, targeting its resources, Jake and his family flee to the Metkayina clan, a reef-dwelling Na'vi group, to seek refuge. They must adapt to an aquatic way of life while confronting both human invaders and internal family struggle",
      "purchase_price": 11.00,
      "rent_price": 3.00
    },
    {
      "id": 2,
      "title": "detective Chinatown",
      "image": "MovieImages/detectiveChinatown.jpg",
      "summary": "In Bangkok's Chinatown, a wealthy Chinese businesswoman is murdered. The case is complex and lacks clear clues, making it difficult for the local police to handle effectively. At this point, Qin Feng and Tang Ren, as detectives, are invited to assist in the investigation. As they delve into the case, they uncover multiple hidden secrets and mysteries. Throughout their journey to uncover the truth, they face numerous challenges and dangers.",
      "purchase_price": 11.00,
      "rent_price": 3.00
    },
    {
      "id": 3,
      "title": "Knowing",
      "featured": true,
      "image": "MovieImages/download.jpeg",
      "summary": "The story follows John Koestler (Nicolas Cage), an MIT professor, who discovers a cryptic numerical code buried in a time capsule from 1959. Written by a disturbed child, the code accurately predicts major global disasters, including dates, locations, and death tolls. As John deciphers it, he realizes some events are still to come, including a catastrophic solar flare that threatens all life on Earth. Racing against time, he tries to protect his son, Caleb, while grappling with fate, free will, and mysterious beings who seem to know the end is near. The film blends suspense, sci-fi, and existential themes\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 4,
      "title" : "Godzilla vs Kong",
      "featured": true,
      "image": "MovieImages/Godzilla_vs._Kong.png",
      "summary": "The story pits Godzilla and Kong, two iconic titans, against each other in a colossal battle. Set years after previous MonsterVerse events, humanity seeks to harness the power of the Titans. Monarch, a secretive organization, transports Kong from Skull Island to the Hollow Earth, a subterranean realm believed to hold answers to the Titans’ origins and a potential energy source. Meanwhile, Godzilla, sensing a threat, begins attacking human facilities, leading to an epic clash with Kong. As the two fight, a deeper conspiracy involving a tech corporation and a hidden Titan agenda unfolds, forcing humans to pick sides in the ultimate monster showdown. \n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 5,
      "title" : "inside out 2",
      "image": "MovieImages/Inside_Out_2_poster.jpg",
      "summary": " (2015). The story revisits Riley, now a 13-year-old navigating the challenges of puberty and high school. Inside her mind, the original emotions—Joy, Sadness, Anger, Fear, and Disgust—are joined by new emotions: Anxiety, Envy, Ennui, and Embarrassment. As Riley faces a crucial hockey camp and the pressures of growing up, Anxiety takes control, sidelining Joy and the others, and reshaping Riley’s sense of self. Joy leads the core emotions on a mission to reclaim their influence, exploring new parts of Riley’s mind like Belief System and Memory Vaults\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 6,
      "title" : "Minions The Rise of Gru",
      "featured": true,
      "image": "MovieImages/Minions_The_Rise_of_Gru_poster.jpg",
      "summary": " series. Set in the 1970s, the film follows a young Gru, an 11-year-old aspiring supervillain, as he dreams of joining the Vicious 6, a notorious villain group. After they reject him following a botched heist involving a powerful zodiac stone, Gru steals the stone with help from his loyal Minions—Kevin, Stuart, Bob, and newcomer Otto. This sparks a wild chase as Gru and the Minions evade the Vicious 6, team up with unexpected allies like martial artist Master Chow, and face off against the villains.\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 7,
      "title" : "Shang-Chi and the Legend of the Ten Rings\n\n",
      "image": "MovieImages/Shang-Chi_and_the_Legend_of_the_Ten_Rings_poster.jpeg",
      "summary": "It follows Shaun (Simu Liu), a skilled martial artist living a quiet life in San Francisco as a parking valet, until his past catches up with him. Revealed as Shang-Chi, he’s the son of Wenwu (Tony Leung), the centuries-old leader of the Ten Rings organization, who wields ten mystical rings granting immense power. When Wenwu summons Shang-Chi and his sister Xialing to join him in a quest to unleash a mythical force from their mother’s hidden village of Ta Lo, Shang-Chi rebels. With his friend Katy (Awkwafina), he confronts his father, uncovers family secrets, and battles to protect the world from a destructive power tied to the rings. \n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 8,
      "title" : "Sing 2",
      "image": "MovieImages/Sing_2_poster.jpg",
      "summary": "\"Sing 2\" is a 2021 animated musical comedy film produced by Illumination Entertainment. It’s the sequel to \"Sing\" (2016) and follows the same lovable cast of anthropomorphic animals as they take their talents to new heights. Here’s a rundown of the plot:\nBuster Moon, the optimistic koala voiced by Matthew McConaughey, has successfully turned his local theater into a thriving venue after the events of the first film. But he dreams bigger—staging a show at the Crystal Tower Theater in the glamorous, Vegas-like Redshore City. With his troupe—including the pig mom Rosita (Reese Witherspoon), rock porcupine Ash (Scarlett Johansson), gorilla Johnny (Taron Egerton), elephant Meena (Tori Kelly), and pig showman Gunter (Nick Kroll)—Buster sets out to impress entertainment mogul Jimmy Crystal (Bobby Cannavale), a wolf with a short temper and high expectations.\nTo win Crystal over, Buster promises to bring back reclusive rock legend Clay Calloway (Bono), a lion who hasn’t performed since his wife’s death years ago. The crew sneaks into an audition, pitches an out-of-this-world show idea (literally, with a space theme), and gets the green light—though Crystal demands Calloway’s involvement, or else. What follows is a whirlwind of challenges: Buster and the gang must create a spectacular production while dodging Crystal’s wrath, helping Johnny overcome his confidence issues with a controlling dance instructor (a monkey voiced by Pharrell Williams), and coaxing Meena into a romantic duet despite her shyness. Meanwhile, Rosita battles stage fright, and Ash helps Clay rediscover his passion for music.\nThe movie’s a mix of heartfelt moments, slapstick humor, and a killer soundtrack featuring songs from artists like U2, Billie Eilish, and Halsey. It’s about chasing dreams, facing fears, and the power of friendship and music to bring everyone together. Without spoiling too much, expect a big, flashy finale that ties it all up with a bow—or maybe a mic drop.\nIf you’ve got more questions about it, just let me know!",
      "purchase_price": 11.00,
      "rental_price": 3.00

    },
    {
      "id": 9,
      "title" : "Thor Love and Thunder",
      "image": "MovieImages/Thor_Love_and_Thunder_poster.jpeg",
      "summary": "\"Thor: Love and Thunder\" is a 2022 superhero film from Marvel Studios, directed by Taika Waititi. It’s the fourth Thor movie and blends action, comedy, and some surprisingly emotional beats. Here’s a quick summary:\nAfter the events of \"Avengers: Endgame,\" Thor (Chris Hemsworth) is trying to find himself, having left New Asgard in Valkyrie’s hands (Tessa Thompson) while he travels with the Guardians of the Galaxy. His semi-retirement gets interrupted when Gorr the God Butcher (Christian Bale), a scarred and grieving figure wielding the Necrosword, starts killing gods across the universe to avenge his daughter’s death and punish divine indifference. Thor teams up with Valkyrie, Korg (voiced by Waititi), and—shockingly—his ex-girlfriend Jane Foster (Natalie Portman), who’s now wielding Mjolnir as the Mighty Thor after being diagnosed with terminal cancer.\nThe crew heads to Omnipotence City, a hub of gods led by a flamboyant Zeus (Russell Crowe), to rally support against Gorr, but that plan flops. Gorr kidnaps New Asgard’s kids, forcing Thor and Jane into a showdown at the center of the universe. Along the way, there’s romance (Thor and Jane rekindle their spark), heartbreak (Jane’s condition worsens), and plenty of Waititi’s signature goofiness—like screaming goats and a jealous Stormbreaker axe. Gorr’s quest ends with a twist of redemption, and Jane’s story takes a bittersweet turn, setting Thor on a new path with an unexpected companion.\nIt’s a wild ride with big laughs, cosmic stakes, and a killer ‘80s rock vibe—think Guns N’ Roses meets god-slaying angst. Let me know if you want more details!\n\nexplore Gorr's backstory\n\nother Marvel villains\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 10,
      "title" : "Top gun 2",
      "featured": true,
      "image": "MovieImages/topgun2.jpeg",
      "summary": "Decades after his days as a hotshot pilot, Pete \"Maverick\" Mitchell (Tom Cruise) is still a Navy captain, avoiding promotion to keep flying. He’s called back to the Top Gun training program to prepare an elite squad of young pilots for a high-stakes mission: destroy an enemy uranium enrichment facility nestled in a nearly impossible-to-reach canyon, guarded by advanced defenses. Maverick’s unorthodox methods clash with the by-the-book Admiral \"Iceman\" Kazansky (Val Kilmer) and Vice Admiral \"Cyclone\" Simpson (Jon Hamm), but he’s got no choice—he’s the best they’ve got.\nThe team includes cocky Lieutenant \"Hangman\" (Glen Powell) and the skilled but cautious Lieutenant \"Rooster\" Bradshaw (Miles Teller), son of Maverick’s late wingman Goose, whose death still haunts Maverick and strains his bond with Rooster. As they train, Maverick pushes the pilots—and himself—to their limits in jaw-dropping aerial sequences, while reconnecting with old flame Penny (Jennifer Connelly). The mission demands a miracle: fly low, hit the target, and escape before enemy jets or missiles take them out. Tensions peak, sacrifices are made, and Maverick proves why he’s still the top gun in a climactic dogfight that ties past and present together.\nIt’s a adrenaline-pumping mix of nostalgia, stunning flight scenes, and emotional payoff, with Cruise at peak Maverick swagger. Want more specifics? Just ask!\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 11,
      "title" : "Venom Let there be Carnage",
      "featured": true,
      "image": "MovieImages/Venom_Let_There_Be_Carnage_poster.jpg",
      "summary": "Eddie Brock (Tom Hardy) is still adjusting to life bonded with the alien symbiote Venom, who’s both his chaotic partner and a nagging voice in his head. Eddie’s a struggling journalist trying to revive his career by interviewing death-row inmate Cletus Kasady (Woody Harrelson), a deranged serial killer. When Cletus bites Eddie during a prison visit, he ingests a piece of the symbiote, which later bonds with him during his execution attempt, transforming him into Carnage—a bloodthirsty, red symbiote way more unhinged than Venom.\nAs Carnage breaks free, he teams up with his obsessive love interest, Frances Barrison (Naomie Harris), aka Shriek, who has sonic scream powers. Together, they wreak havoc, targeting Eddie and anyone tied to Cletus’s twisted past. Eddie and Venom, meanwhile, bicker like an old married couple—Venom even ditches Eddie briefly—but reunite to stop Carnage. With help from Eddie’s ex, Anne (Michelle Williams), they face off in a wild, CGI-heavy showdown at a cathedral during Cletus and Frances’s warped wedding. It’s a battle of symbiote vs. symbiote, ending with Venom chowing down on Carnage and a mid-credits tease tying into the Spider-Man universe.\nThe movie’s a loud, messy romp with dark humor, Hardy’s dual-performance charm, and plenty of symbiote-on-symbiote action. Need more details?\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    },
    {
      "id": 12,
      "title" : "Wonka",
      "image": "MovieImages/Wonka_2023_film_poster.jpg",
      "summary": "The story follows a young Willy Wonka (Timothée Chalamet), a dreamy inventor and chocolatier with big ambitions but little money. Arriving in a vibrant, whimsical city, he’s determined to open his own chocolate shop and share his magical confections with the world. However, he’s quickly swindled into indentured servitude at a dreary boarding house run by the conniving Mrs. Scrubitt (Olivia Colman) and her lackey Bleacher (Tom Davis). There, he meets a ragtag group of fellow captives, including the clever orphan Noodle (Calah Lane), who becomes his ally.\nFacing a greedy chocolate cartel—Slugworth (Paterson Joseph), Prodnose (Matt Lucas), and Fickelgruber (Mathew Baynton)—who’ll stop at nothing to keep their monopoly, Wonka uses his ingenuity, charm, and fantastical candy creations (like hover chocolates and emotion-altering sweets) to outwit them. With help from Noodle and a quirky crew, including a pint-sized Hugh Grant as an Oompa-Loompa named Lofty, Wonka stages guerilla-style chocolate sales across the city, winning over the public. Along the way, he uncovers a personal connection to his late mother (Sally Hawkins) and her dream for him, fueling his resolve.\n\n",
      "purchase_price": 11.00,
      "rental_price": 3.00
    }
  ]
}
